{ 
"/index.html": {
    "home": "Home",
    "projects": "Projects",
    "about": "About",
    "hello": "Hello! ^_^<br>I'm Luís Fernando,<br>Embedded Developer",
    "ido": "I develop and maintain embedded systems. That is, software/hardware that control consumer electronics, automotive, healthcare, defense equipments, and so on. ",
    "contact": "For more info, feel free to contact me at &nbsp;<a href=\"mailto:luisfmiki@gmail.com\">luisfmiki@gmail.com</a> &nbsp;<i class=\"fa-regular fa-envelope\"></i>"
  },
"/projects/index.html": {
  "home": "Home",
  "projects": "Projects",
  "about": "About",
  "1": {
    "title": "Digital Refractometer",
    "keywords": "C, Timers, Optics, Instrumentation, ATmega328, Photodiode, Low-power",
    "shortdescription": "A Refractometer is a device that measures a fluid's refractive index, that is, how much the path of light is bent compared to vacuum within it. Used mainly in fluid products quality control. In this project, it's presented a low-cost digital version of this device."
  },
  "2": {
    "title": "UaiKey v2",
    "keywords": "C++, IoT, ESP8266, RFID, Cryptography, LabVIEW, SPI, TCP/IP",
    "shortdescription": "UaiKey is a acess control system built with an embedded door lock and a desktop admin control panel that can access the embedded device remotely from anywhere with internet access. The communication between the devices and the transactions are secured."
  },
  "3": {
    "title": "MeuLab",
    "keywords": "C++, ESP8266, WebSockets, Sensors, IoT, LabVIEW, Signal Processing",
    "shortdescription": "MeuLab is an embedded platform that accepts a wide variety of sensors. MeuLab can measure, plot, and analyze multiple physical quantites data simultaneously. It communicates via wireless with a desktop or mobile app that show the results."
  },
  "4": {
    "title": "Glass door",
    "keywords": "Iot, Automation, ESP8266, Electronics",
    "shortdescription": "This project marks my entrance in embedded development, at the second year of the covid pandemic. It is a modification of a residential building door lock. I made it unlockable throught the resident's smartphone since the only way to unlock the door was locally."
  },
  "5": {
    "title": "Voltage Source",
    "keywords": "PCB, Electronics, Digital, Analog",
    "shortdescription": "Undergraduate project from the Electronic Circuits Laboratory I. Powered by the local electrical grid network, it is presented a voltage-source that varies from -15V to +15V with a digital over-current protection."
  },
  "6": {
    "title": "Microscopy Analogies",
    "keywords": "C, Control Engineering, Signal Processing, Scanning probe, SEM, STM, AFM",
    "shortdescription": "Project under development"
  },
  "keyword": "Keywords: ",
  "type": "Type: ",
  "science": "Scientifc ",
  "tech": "Tech ",
  "hobby": "Hobby ",
  "school": "Scholar ",
  "seedetail": "See project details <i class=\"fa-solid fa-circle-info\"></i>"
  },
"/projects/digital-refractometer/index.html": {
  "home": "Home",
  "projects": "Projects",
  "about": "About",
  "name": "digital-refractometer",
  "keywords": "C, Timers, PWM, Optics, Instrumentation, ATmega328, Photodiode, Low-power",
  "title": "Digital Refractometer &nbsp; <i class=\"fa-solid fa-camera\"></i>",
  "objective": "<b>Objective: </b>Build an low-cost and precise digital refractometer to be used as data collector in a automation process that characterize human biological samples.",
  "requirements": "<b>Requirements: </b><ol><li>The device should measure the refractive index of sample and room temperature;</li> <li>At least three differents light wavelengths need to be available to choose;</li><li>The device should deliever a report of measures through a .csv, but also show the current measure through a display;</li></ol>",
  "role": "<b>Role: </b>Electronics and firmware",
  "process": "<b>Development process and requirement meeting: </b><br><b>Requirment #1</b><br> First, made the optics modelling of the problem using GeoGebra to get the position of the optical components. After that, started to program an IC linear CCD sensor to get the value of light intensity, for this task I used ATmega328p's 3/3 timers to generate PWM for meeting the signal waveforms as instructed in the IC's datasheet (if more timers were needed, then would choose another microcontroller), also used two ADC pins to read the light intensity signal and temperature through a NTC Thermistor. With the light intensity versus position, used the optics geometric model and Snell's law to achieve the refractive index.<br><b>Requirement #2</b><br>Made a PCB with 3 SMD LEDs with different colors as an optical component metioned above. Only one color (wavelength) is on at a time. Thus, programmed this with a push button that changes the color.<br><b>Requirement #3</b><br>Used LabVIEW to program simple desktop interface do export the data throught a USB cable that connects with the device. The data is stored in the microcontroller's flash memory since the user can choose to collect after a long set of measures. For displaying the results, used the Adafruit's SSD1306 OLED library, but had to bypass the Adafruit's library to achieve low-power purposes. Speaking of low-power, also programmed the arduino to sleep after some time with no commands/tasks. Then had to program an on/off (sleep/wakeup) button through external interrupt and some assembly code to ensure a specific order of instructions.",
  "problems": "<b>Problems and overcomes: </b><ul><li>For some reason the analog signal of the CDD was pretty random. Even certifying that the digital signals were exactly as the IC's datasheet instructs, I struggled for some time until I realized that the signal was much alike an floating pin. Then tried to put a pull-down resistor between the ADC pin and the anlog pin of the IC. Finally the analog value was coherent, however this resistor was not mentioned anywhere inside the IC's datasheet usage instructions.</li></ul>",
  "imgdescription1": "A Digital Refractometer prototype made in <a href=\"https://eitaufmg.wixsite.com/eita\">EITA!</a>",
  "imgdescription2": "TSL1401CL, the used Integrated-Circuit Linear CCD Sensor",
  "imgdescription3": "The light rays optics model with a acrylic prism programmed in Geogebra"
  },
"/projects/uaikey/index.html": {
  "home": "Home",
  "projects": "Projects",
  "about": "About",
  "name": "uaikey",
  "keywords": "C++, IoT, ESP8266, RFID, Cryptography, LabVIEW, TCP/IP",
  "title": "Uaikey v2 &nbsp;<i class=\"fa-solid fa-building-lock\"></i>",
  "objective": "<b>Objective: </b>Since the losing of keys were becoming a problem in the physics department, emrgerged a need to build a low-cost access control system for the laboratories.",
  "requirements": "<b>Requirements: </b><ol><li>The acess control would be using the university's ID cards;</li><li>A desktop app for the administrator of the laboratory;</li><li>Wireless communication between the devices of the whole system;</li></ol>",
  "role": "<b>Role: </b>Embedded & Desktop software",
  "process": "<b>Development process and requirement meeting: </b><br>Since I worked on the second version of the system, all the requirements were basically already met but the original programmer was not available. So what I did most was a reverse engineering, refactor, and optimize of the embedded code, for instance, the cryptographic algorithm was only using the first byte of keys of N-bytes in all communcation messages😱, it was a mess, so I decided to rebuild the crypto code from zero. I don't blame him, I've been told that he coded this system right after learning C++. Also, all of the desktop app was on top of the C++ Qt library, but we deciced to remake it using LabVIEW since is a language quite used in EITA!. Besides that, also added some new functionalities and plan to implement a state machine inside the embedded code to display the number of people inside the room to be used in the physics's department clean room.<br>Since this project is not small, I encourage you to ask me directly at my contacts for any question regarding things like harwared used and technical aspects. A more detailed page of this project first version can be found <a href=\"https://eitaufmg.wixsite.com/eita/uaikey\">here</a> (Portuguese)",
  "problems": "<b>Problems and overcomes: </b><ul><li>There was a critcal problem where that if the embedded device somehow stopped responding in the middle of communcation transactions because of things like power shut-downs or unpredicted code sequence bugs (super-loop embedded architecture), this could lead to serious memory leaks and desynchronization in data between the embedded device and the remote control device. What I did was a 'pseudo-protocol' on top of TCP to handle those kind of failures in the communication link.</li",
  "imgdescription1": "The Uaikey's v2 embedded device to read the acess cards",
  "imgdescription2": "The Uaikey's v2 remote desktop admin panel"
  },
"/projects/meulab/index.html": {
  "home": "Home",
  "projects": "Projects",
  "about": "About",
  "name": "meulab",
  "keywords": "C++, ESP32, WebSockets, Sensors, IoT, LabVIEW, Signal Processing",
  "title": "MeuLab &nbsp;<i class=\"fa-solid fa-flask-vial\"></i>",
  "objective": "<b>Objective: </b>Build a low-cost embedded platform for any grade student to perform measures in laboratory lessons.  Acquired by schools and universities.",
  "requirements": "<b>Requirements: </b><ol><li>The device should accept a wide variety of sensors for different physical phenomena;</li><li>The device must able to perform measures coming from different sensors at the same time;</li><li>The system must have both desktop and mobile app for the user to control the experiment and analyzing it;</li></ol>",
  "role": "<b>Role: </b>Embedded Software",
  "process": "<b>Development process: </b><br>These three are the top ones requirements that defines the system, but since I worked only in the integration of the force sensor, it's not worth mentioning them. So I just assembled the measuring circuit with a strain gauge and a HX711 amplifier and started to read it with an arduino. This amplifier do not communicate via I2C, rather it has its own protocol, but luckly it had a library. After that, turned this piece of code in a module and sent it to a more experciened programmer to include it as a task in the RTOS. This was my first project to work in EITA!, so I was still a newbie in embedded development, not that I am an experiencied programmer aswell.",
  "imgdescription1": "A MeuLab embedded device protype with sensors for magnetic field, heartbeat, light, distance. All sensors are plugable on the embedded platform.",
  "imgdescription2": "The force sensor with the HX711 green board with the straing gauge at the bottom.",
  "imgdescription3": "The MeuLab mobile app for plotting data."
  },
"/projects/glass-door/index.html": {
  "home": "Home",
  "projects": "Projects",
  "about": "About",
  "name": "glass-door",
  "keywords": "IoT, Automation, ESP8266, Electronics",
  "title": "Glass-door &nbsp;<i class=\"fa-solid fa-door-open\"></i>",
  "objective": "<b>Objective: </b>Ease the reception of visitors for residents in a residential building.",
  "requirements": "<b>Problem:</b><br>The problem was that the entrance of the building had 2 doors, one main gate that was unlockale via intercom and physical key, and other glass-door that was unlockabe only through physical key and a access control with digit password. If a resident receives a visitor, one has press the intercom button to open the first door then get out of their apartment and unlock the glass-door manually. As you can see it gets worse if the resident lives in higher floors, meaning that the resident need to travel more. So my idea was to make this second door unlockable via the resident's smartphone. In this way, they can stay inside their aparment.<br><b>Requirements: </b><ol><li>Make a common glass door be unlockable through the resident's smartphones.</li>",
  "role": "<b>Role: </b>Electronics and firmware",
  "process": "<b>Development process and requirement meeting: </b><br>Used my ESP12-E development board to give a signal that would act like a electronic switch to open the door. As showed in the circuit, I bypassed all the original acess control that was there already installed by using a power transistor with a flybackdiode that is connected direcly to the door magnet lock's common node. In this way, the circuit that I made wouldn't interfer the installed acess control functioality. Also got some +12V supply from this acess control system. To unlock via smartphone, I used the IoT cloud platform Blink. Then, the residents only need to download de Bink app and press one button in their smartphone to unlock the door. Initially I thought to make an http server inside the ESP8266, but for that it would need some IP port forwarding, a thing that the local ISPs here generally doesn't allow. That's why I choosed Blink.",
  "problems": "<b>Problems and overcomes: </b><ul><li>I was trying to unlock the door with only one pulse on the digital pin that goes into the base of the transistor. That wouldn't work. But after hearing the installed acess control opening the door, I realized that was some sequential swtiching for about 1 second to open the magnetic door lock. After that, I tried to do the same in the digital pin by giving some pules about 10hz and it worked. At that time, I didn't know exaclty why this worked because never had studied faraday's law before.</li>",
  "imgdescription1": "The installed acess control opened with the ESP12-E bypassing it on the left. The glass-door on the right.",
  "imgdescription2": "The schematic for the circuit above. The acess control circuit is not shown.",
  "imgdescription3": "A diagram showing the situation."
  },
"/projects/voltage-source/index.html": {
  "home": "Home",
  "projects": "Projects",
  "about": "About",
  "name": "voltage-source",
  "keywords": "PCB, Electronics, Digital, Analog",
  "title": "Voltage Source &nbsp;<i class=\"fa-solid fa-bolt\"></i>",
  "objective": "<b>Objective: </b><br>Build a DC Voltage Source power supply as a laboratory subject final project.",
  "requirements": "<b>Requirements:</b><ol><li>It should be able to deliever voltage in the -15V to +15V range;</li><li>It should have a protection for overcurrent above 1A;</li><li>It should be powered itself from the 127Vrms consumer eletrical grid</li></ol>",
  "role": "<b>Role:</b><br>Circuit design, PCB design and soldering.",
  "process": "<b>Development process and requirement meeting: </b><br>In this project, I worked with a lab pair, so we were in the same role. Basically, we split up the work load for each step of the project. First, we started to design the circuit by calculating all the functional blocks as seen in theoretical classes. The third requiremente was easily achieved by using a rectifier citcuit. The voltage range requirement was achievied by using the potentiometers, some OpAmps stages, and transistor for a feedback loop. The overcurrent protection was achieved by using a shunt resistor, an OpAmp stage and a CD4013BE Dual D-Flip-Flop to switch a transistor to sink the power. After that, we draw the PCB, soldered and tested all the circit parts. These last two were the steps that most took time.",
  "problems": "<b>Problems and overcomes: </b><ul><li>After designing the PCB, the computer that controls the CNC machine started to randomly rebooting. This failure cause to the CNC to loss the original (X,Y) reference in the machining process. That way, my board started get the routes messy and then the board turned out to be unusable. Because of that, we had to switch to an already done (with some project mistakes) emergency board. Then, had to look up for the schematic of this board and solder some different components, but managed to still use the components that we bought by doing some adaptations, for instance, this emergecy board used a zener to regulate a 2.1V supply, but we used our 3 1N4148 and soldered all in the same spot for ony one zener.</li>",
  "imgdescription1": "The complete project schematic",
  "imgdescription2": "The bottom layer of the PCB",
  "imgdescription3": "Testing the output of the voltage source with a resistive load."
  },
"/projects/microscopy-analogies/index.html": {
  "home": "Home",
  "projects": "Projects",
  "about": "About",
  "name": "microscopy-analogies",
  "keywords": "C, Control Engineering, Signal Processing, Scanning probe, SEM, STM, AFM"
}, 

"/about/index.html": {
  "home": "Home",
  "projects": "Projects",
  "about": "About",
  "text1": "Majoring Electrical Engineering with emphasis in microelectronics, I'm an undergrad student at Federal University of Minas Gerais (UFMG) highly interested in technology and science topics such as mixed-signal electronics, optics, EVs, nanotechnology, AI, and computer architecture.\nBesides the fun of learning these topics, my motivation comes from the pleasure of understading how things around us work, and with this understanding, contribute to the humanity's technological progress.",
  "lab1description": "Analog and digital electronics teaching lab at UFMG",
  "text2": "At the moment, aside of hobby projects, most of my experience in embedded comes from an technology learning space at my university called \"EITA!\". At this space I work with other undergrad students creating scientifc instrumentation (mainly) and physics demonstrations. Even though I think EITA! is a perfect enviroment for hands-on learning, I'm planning to do an internship by the year of 2024.\n The figures at this page shows some locations where I learn." ,
  "lab2description": "Prototyping area at EITA!",
  "text3": "As for my skills, let's say you can have a deeper understanding seeing the \"Projects\" tab, but for summary purposes, I currently have knowledge in:",
  "lab3description": "Workshop area at EITA!",
  "proglang": "Programming languages: ",
  "tools": "Tools: ",
  "ll-hw": "Low-Level/Hardware: "
  }
}